Revit 2026 API

# MacroManagerGetEnumerator Method

---

Returns an enumerator that iterates through a collection.

**Namespace:** Autodesk.Revit.DB.Macros**Assembly:** RevitAPIMacros (in RevitAPIMacros.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public virtual IEnumerator<MacroModule> GetEnumerator()
```
```vb
Public Overridable Function GetEnumerator As IEnumerator(Of MacroModule)
```
```cpp
public:
virtual IEnumerator<MacroModule^>^ GetEnumerator()
```
```fsharp
abstract GetEnumerator : unit -> IEnumerator<MacroModule>
override GetEnumerator : unit -> IEnumerator<MacroModule>
```

#### Return Value

IEnumeratorMacroModuleAn IEnumerator object that can be used to iterate through the collection.

#### Implements

IEnumerableTGetEnumerator

#### Reference

MacroManager Class

Autodesk.Revit.DB.Macros Namespace